chempin/stm32f107-/8.DS18B20/USER/main.c
#include "stm32f10x.h"
#include "LED.h"
#include "delay.h"
#include "sys.h"
#include "usart.h"
#include "TFT.h"
#include "DS18B20.h"

int main(void)
{
	short temp;
		
	SystemInit(); 
	delay_init();
	uart_init(9600);
	LED_Init();
	LCD_Init();

	
	POINT_COLOR=RED;//设置字体为红色	   
	LCD_ShowString(60,50,"Mini STM32");	
	LCD_ShowString(60,70,"DS18B20 TEST");	
	LCD_ShowString(60,90,"ATOM@ALIENTEK");
	LCD_ShowString(60,110,"2011/1/1");
	
	while(DS18B20_Init())//初始化DS18B20,兼检测18B20
	{
		LCD_ShowString(60,130,"DS18B20 Check Failed!");
		delay_ms(500);		  
		LCD_ShowString(60,130,"Please Check!        ");
		delay_ms(500);
		LED_01();//DS0闪烁
	}
	
  LCD_ShowString(60,130,"DS18B20 Ready!     ");	 
 	POINT_COLOR=BLUE;//设置字体为蓝色	   
	LCD_ShowString(60,150, "Temperate:   . C");	 
	
	while(1)
	{	  
		temp=DS18B20_Get_Temp();
		if(temp<0)
		{
			temp=-temp;
			LCD_ShowChar(140,150,'-',16,0);//显示负号	
		}						 
		LCD_ShowNum(148,150,temp/10,2,16);//显示温度值	  
		LCD_ShowNum(172,150,temp%10,1,16);//显示温度值
		//printf("t1:%d\n",temp);
		delay_ms(200);
		LED_01();
	}	
}
